//to do.. use {0:f2} If you can't - use your photo from iPhone;

using System;

class Program
{
    static void Main(string[] args)
    {
        int ageLili = int.Parse(Console.ReadLine());
        double washingMachine = double.Parse(Console.ReadLine());
        int toyPrice = int.Parse(Console.ReadLine());
        int moneyForBthd = 10;
        int cnt = 1;
        int moneySaved = 0;

        for (int age = 0; age < ageLili; age++)
        {
            if (age % 2 == 0)
            {
                moneySaved += moneyForBthd - 1;
                moneyForBthd += 10;
                cnt++;
            }
            else
            {
                moneySaved += toyPrice;
            }
        }
        moneySaved = moneySaved - cnt;
        if (moneySaved >= washingMachine)
        {
            Console.WriteLine("Yes!, {0:f2}", moneySaved - washingMachine);

        }
        else
        {
            Console.WriteLine("No!, {0:f2}", moneySaved - washingMachine);
        }
    }
}

//Лили вече е на N години.За всеки свой рожден ден тя получава подарък.За нечетните 
//    рождени дни (1, 3, 5...n) получава играчки, а за всеки четен(2, 4, 6...n) получава пари.
//    За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв, за всеки следващ 
//        четен рожден ден (2 -> 10, 4 -> 20, 6 -> 30...и т.н.). През годините Лили тайно е спестявала парите.
//    Братът на Лили, в годините, които тя получава пари, взима по 1.00 лев от тях.Лили продала играчките получени 
//    през годините, всяка за P лева и добавила сумата към спестените пари.С парите искала да си купи пералня за X лева.
//    Напишете програма, която да пресмята, колко пари е събрала и дали ѝ стигат да си купи пералня.
//Вход
//От конзолата се прочитат 3 числа, на отделни редове:
//•	Възраста на Лили – цяло число в интервала [1...77]
//•	Цената на пералнята – число в интервала[1.00...10 000.00]
//•	Единична цена на играчка – цяло число в интервала [0...40]
//Изход
//Да се отпечата на конзолата един ред:
//•	Ако парите на Лили са достатъчни:
//o   “Yes! { N}” – където N е остатъка пари след покупката
//•	Ако парите не са достатъчни:
//o	“No! {М}“ – където M е сумата, която не достига
//•	Числата N и M трябва да за форматирани до вторият знак след десетичната запетая.
