//Четвърта задача от междинния изпит на 26 март 2016. Тествайте решението си тук.
//Дадени са n цели числа в интервала [1…1000]. От тях някакъв процент p1 се
//    делят без остатък на 2, друг процент p2 се делят без остатък на 3, друг процент p3 
//    се делят без остатък на 4. Да се напише програма, която изчислява и отпечатва процентите p1, p2 и p3.
//Пример: имаме n = 10 числа: 680, 2, 600, 200, 800, 799, 199, 46, 128, 65. 
//    Получаваме следното разпределение и визуализация:
//Деление без остатък на:	Числа в диапазона Брой числа Процент
//2	680, 2, 600, 200, 800, 46, 128	7	p1 = 7.0 / 10 * 100 = 70.00 %
//3	600	1	p2 = 1 / 10 * 100 = 10.00 %
//4	680, 600, 200, 800, 128	5	p3 = 5 / 10 * 100 = 50.00 %
//Вход
//На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа.
//    На следващите n реда стои по едно цяло число в интервала [1…1000] – числата които 
//    да бъдат проверени на колко се делят.


using System;
class Program
{
    static void Main()
    {
        int n = int.Parse(Console.ReadLine());
        double cnt = 0;
        double cnt1 = 0;
        double cnt2 = 0;

        for (int i = 0; i < n; i++)
        {
            int num = int.Parse(Console.ReadLine());
            if (num % 2 == 0)
            {
                cnt++;
            }
            if (num % 3 == 0)
            {
                cnt1++;
            } 
            if (num % 4 == 0)
            {
                cnt2++;
            }
        }
        double a = (cnt / n  * 100);
        Console.WriteLine("{0:f2}%", a);
        Console.WriteLine("{0:f2}%", cnt1 / n * 100);
        Console.WriteLine("{0:f2}%", cnt2 / n * 100);
    }
}