using System;

class Program
{
    static void Main()
    {
        int n = int.Parse(Console.ReadLine());
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j <= i; j++)
            {
                Console.Write("*");
            }
            Console.WriteLine();                      
        }
    }
}

//Напишете програма, която чете от конзолата число n и чертае квадрат от n * n звездички.
//    Разликата с предходната задача е, че между всеки две звездички има по един интервал.Примери:
//вход изход       вход изход       вход изход
//2	**
//**		3	***
//***
//***		4	****
//****
//****
//****
