using System;

class Program
{
    static void Main()
    {
        var sideSquare = double.Parse(Console.ReadLine());
        var widePlate = double.Parse(Console.ReadLine());
        var longPlate = double.Parse(Console.ReadLine());
        var wideBench = double.Parse(Console.ReadLine());
        var longBench = double.Parse(Console.ReadLine());

        double benchArea = wideBench * longBench;
        double squareAreaFinal = sideSquare * sideSquare - benchArea;
        double plateArea = widePlate * longPlate;
        double platesForSquare = squareAreaFinal / plateArea;
        double timeForWork = platesForSquare * 0.2;

        Console.WriteLine(platesForSquare);
        Console.WriteLine(timeForWork);
    }
}
//19.	* Ремонт на плочки
//На площадката пред жилищен блок трябва да се поставят плочки.
//Площадката е с форма на квадрат със страна N метра.
//Плочките са широки „W“ метра и дълги „L“ метра.
//На площадката има една пейка с ширина M метра и дължина O метра.
//Под нея не е нужно да се слагат плочки.Всяка плочка се поставя за 0.2 минути.
//Напишете програма, която чете от конзолата размерите на площадката, плочките и 
//пейката и пресмята колко плочки са необходими да се покрие площадката и пресмята 
//времето за поставяне на всички плочки.
//Пример: площадка с размер 20м.има площ 400кв.м.
//Пейка широка 1м.и дълга 2м., заема площ 2кв.м.
//Една плочка е широка 5м.и дълга 4м.има площ = 20кв.м.
//Площта която трябва да се покрие е 400 – 2 = 398 кв.м.
//Необходими са 398 / 20 = 19.90 плочки.Необходимото време е 19.90 * 0.2 = 3.98 минути.
//Вход
//От конзолата се четат 5 числа:
//•	N – дължината на страна от площадката в интервала[1...100]
//•	W – широчината на една плочка в интервала [0.1...10.00]
//•	L – дължината на една плочка в интервала [0.1...10.00]
//•	М – широчината на пейката в интервала[0...10]
//•	О – дължината на пейката в интервала[0...10]
//Изход
//Да се отпечата на конзолата две числа: броят плочки необходи за ремонта и времето за 
// поставяне, всяко на нов ред.
